<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"6b5903926106df73e8b8040f9e25e9ca24624ca3cfc0454e4d86aecac1aeba13","plan_job_ref":"Job Test plan target and replace #404 at https://github.com/dflook/terraform-github-actions/actions/runs/7503550453","plan_out_hash":"88e196ebc1b41943a5507cb213663384db8c91d63259a26e7dccde1cc5ebe221","plan_hash":"56ef62a8268a2a7dbbf2f2db6f7292d1a913e41453bc180281284b2d3eab5a68","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "EpBKYaM6wu" -> (known after apply)
!~  foreach = "etbYGYmawY" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #404](https://github.com/dflook/terraform-github-actions/actions/runs/7503550453)